#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eggs-projects/eggs-projects-ghost-blog/runs/run-eUD82iCnteohpUTR

Waiting for the plan to start...

Terraform v1.3.5
on linux_amd64
Initializing plugins and modules...
random_password.mysql_password: Refreshing state... [id=none]
data.aws_route53_zone.zone: Reading...
data.aws_ami.ubuntu: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-020027e80f853677a]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=470292911211]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-072d6c9fae3253f26]
aws_security_group.ghost_lb_sg: Refreshing state... [id=sg-08ed1fdf24a6dc7de]
aws_lb_target_group.ghost_lb_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:470292911211:targetgroup/eggs-projects-ghost-blog-tg/fad5d21f2661a873]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-068d245baf1111b13]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07b5782e1c9f0324b]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-020cf1febe88b8b05]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0902812efffe7a937]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-044354c1ac6a9a1c4]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0f0fa0cac91a5de67]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-048ed4f1f8d3151c7]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02b94d614a43ec2ff]
aws_security_group.ghost_asg_sg: Refreshing state... [id=sg-06c282d9d7d2bd727]
data.aws_route53_zone.zone: Read complete after 1s [id=Z05289123I8ECO4UF5YZK]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-06d3fe9a79cb8bd6f]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0e7f132d3473f837b]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=eggs-projects-ghost-blog-vpc]
aws_db_subnet_group.default: Refreshing state... [id=eggs-projects-ghost-blog-main]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-041b748f85d6e22b9]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e0db26176e2d317d]
aws_lb.ghost_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:470292911211:loadbalancer/app/eggs-projects-ghost-blog-alb/a6a4f4ea99d40095]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07b5782e1c9f0324b1080289494]
aws_security_group.mysql_sg: Refreshing state... [id=sg-0cb3d078b538c3b76]
aws_lb_listener.ghost_lb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:470292911211:listener/app/eggs-projects-ghost-blog-alb/a6a4f4ea99d40095/f11639423126240e]
aws_db_instance.default: Refreshing state... [id=terraform-20221124015810649900000001]
aws_launch_configuration.ghost_lc: Refreshing state... [id=eggs-projects-ghost-blog-lc20221124010819239300000001]
aws_autoscaling_group.ghost_asg: Refreshing state... [id=eggs-projects-ghost-blog-asg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.ghost_asg will be updated in-place
  ~ resource "aws_autoscaling_group" "ghost_asg" {
        id                        = "eggs-projects-ghost-blog-asg"
      ~ launch_configuration      = "eggs-projects-ghost-blog-lc20221124010819239300000001" -> (known after apply)
        name                      = "eggs-projects-ghost-blog-asg"
        # (23 unchanged attributes hidden)
    }

  # aws_db_instance.default will be updated in-place
  ~ resource "aws_db_instance" "default" {
      - final_snapshot_identifier             = "ghostdb-20221124015809" -> null
        id                                    = "terraform-20221124015810649900000001"
        name                                  = "ghostdb"
      ~ parameter_group_name                  = "default.mysql5.7" -> "eggs-projects-ghost-blog-pg"
      ~ skip_final_snapshot                   = false -> true
        tags                                  = {}
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_db_parameter_group.default will be created
  + resource "aws_db_parameter_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "mysql5.7"
      + id          = (known after apply)
      + name        = "eggs-projects-ghost-blog-pg"
      + name_prefix = (known after apply)
      + tags_all    = {
          + "Owner" = "eggs-projects-ghost-blog"
        }
    }

  # aws_iam_instance_profile.ec2_profile will be created
  + resource "aws_iam_instance_profile" "ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "eggs-projects-ghost-blog-ec2-profile"
      + path        = "/"
      + role        = "eggs-projects-ghost-blog-ec2-role"
      + tags_all    = {
          + "Owner" = "eggs-projects-ghost-blog"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eggs-projects-ghost-blog-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Owner" = "eggs-projects-ghost-blog"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ec2_role will be created
  + resource "aws_iam_role_policy_attachment" "ec2_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eggs-projects-ghost-blog-ec2-role"
    }

  # aws_launch_configuration.ghost_lc must be replaced
+/- resource "aws_launch_configuration" "ghost_lc" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:470292911211:launchConfiguration:7a9b0e96-e154-46e9-b76f-d894f9577efe:launchConfigurationName/eggs-projects-ghost-blog-lc20221124010819239300000001" -> (known after apply)
      ~ associate_public_ip_address      = false -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "eggs-projects-ghost-blog-lc20221124010819239300000001" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "eggs-projects-ghost-blog-lc20221124010819239300000001" -> (known after apply)
      + user_data                        = (sensitive value) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (5 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_route53_record.admin will be created
  + resource "aws_route53_record" "admin" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "admin.mikeeggers.com"
      + type            = "A"
      + zone_id         = "Z05289123I8ECO4UF5YZK"

      + alias {
          + evaluate_target_health = true
          + name                   = "eggs-projects-ghost-blog-alb-353484903.us-east-1.elb.amazonaws.com"
          + zone_id                = "Z35SXDOTRQ7X7K"
        }
    }

  # aws_route53_record.blog will be created
  + resource "aws_route53_record" "blog" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "blog.mikeeggers.com"
      + type            = "A"
      + zone_id         = "Z05289123I8ECO4UF5YZK"

      + alias {
          + evaluate_target_health = true
          + name                   = "eggs-projects-ghost-blog-alb-353484903.us-east-1.elb.amazonaws.com"
          + zone_id                = "Z35SXDOTRQ7X7K"
        }
    }

Plan: 7 to add, 2 to change, 1 to destroy.


```

</details>

*Pushed by: @michaeldeggers, Action: `pull_request`*